Revit 2024 API
BuiltInFailures.SketchFailures.InvalidAreaLoadSketch Property
 Area Load has invalid Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidAreaLoadSketch { get; }
Visual Basic
Public Shared ReadOnly Property InvalidAreaLoadSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidAreaLoadSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace